AcroDance-Comm/app/Http/Controllers/PostController.php

select * from "posts" order by "id" desc
---
    public function index()
    {
        // 投稿と関連する地図情報を取得
        $posts = Post::with('mapInfo')->orderBy('id', 'desc')->paginate(10);

insert into "posts" ("title", "content", "location_name", "preferred_gender", "preferred_group_size", "user_id") values ('ああああ', 'あああああああ', '松本スタジオ', 'male', 'two', 6) returning "id"
insert into "map_infos" ("activity_location", "latitude", "longitude", "post_id") values ('名古屋市', '35.18145060000001', '136.9065571', 224) returning "id"
---
    public function store(Request $request)
    {
        Log::info('Request Data: ', $request->all());

        $request->validate([
            'title' => 'required|string|max:255',
            'content' => 'required|string',
            'location_name' => 'required|string|max:255',
            'latitude' => 'required|numeric',
            'longitude' => 'required|numeric',
            'preferred_gender' => 'nullable|string',
            'preferred_group_size' => 'nullable|string',
        ]);

        try {
            // 投稿データを作成
            $post = Post::create([
                'title' => $request->title,
                'content' => $request->content,
                'location_name' => $request->location_name,
                'preferred_gender' => $request->preferred_gender,
                'preferred_group_size' => $request->preferred_group_size,
                'user_id' => Auth::id(),
            ]);

            // 関連する地図情報を作成
            MapInfo::create([
                'activity_location' => $request->location_name,
                'latitude' => $request->latitude,
                'longitude' => $request->longitude,
                'post_id' => $post->id,
            ]);

select * from "map_infos" where "map_infos"."post_id" = 229 and "map_infos"."post_id" is not null limit 1
select * from "posts" where "posts"."id" = '229' limit 1
---
    public function show($id)
    {
        try {
            $post = Post::with('mapInfo','user')->findOrFail($id); //投稿者情報も取得

select * from "posts" where "posts"."id" = '214' limit 1
---
    public function edit($id)
    {
        $post = Post::findOrFail($id);