AcroDance-Comm/app/Http/Controllers/PostController.php

insert into "posts" ("title", "content", "location_name", "preferred_gender", "preferred_group_size", "user_id") values ('あああ', 'ああああ', null, 'male', 'two', 6) returning "id"
---
    public function store(Request $request)
    {
        $request->validate([
            'title' => 'required|string|max:255',
            'content' => 'required|string',
            'location_name' => 'nullable|string|max:255',
            'preferred_gender' => 'nullable|string',
            'preferred_group_size' => 'nullable|string',
        ]);

        Post::create([
            'title' => $request->title,
            'content' => $request->content,
            'location_name' => session('selectedLocation'),
            'preferred_gender' => $request->preferred_gender,
            'preferred_group_size' => $request->preferred_group_size,
            'user_id' => Auth::id(),
        ]);